---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.TagFailures.ElementCategoryChangeInvalidatesTagUpgrade
source: html/e85b6ebc-adac-491b-df75-77b9ca37e46b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TagFailures.ElementCategoryChangeInvalidatesTagUpgrade Property

During upgrade, Revit discovered that the highlighted elements were marked with tags of the wrong category. These tags were deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementCategoryChangeInvalidatesTagUpgrade { get; }
```